如梦令·纤月黄昏庭院
纤月黄昏庭院
菩萨蛮·枕前发尽千般愿
枕前发尽千般愿
寻芳草·萧寺记梦
萧寺记梦
生查子·情景
减字木兰花·相逢不语
相逢不语
浣溪沙·相见休言有泪珠
相见休言有泪珠
六幺令·绿阴春尽
绿阴春尽
子衿
凤凰山下
生查子·长恨涉江遥
长恨涉江遥
竹枝词·山桃红花满上头
山桃红花满上头
蝶恋花·几度凤楼同饮宴
几度凤楼同饮宴
古词三首
忆秦娥·花深深
花深深
摸鱼儿·问莲根有丝多少
问莲根有丝多少
无题·来是空言去绝踪
来是空言去绝踪
渔家傲·近日门前溪水涨
近日门前溪水涨
双燕离
离思五首·其四
将仲子
南歌子·似带如丝柳
似带如丝柳
女曰鸡鸣
寿阳曲·云笼月
云笼月
菩萨蛮·彩舟载得离愁动
彩舟载得离愁动
减字木兰花·春夜闻隔墙歌吹声
春夜闻隔墙歌吹声
望远行·绣帏睡起
绣帏睡起
乌夜啼
迢迢牵牛星
一落索·杨花终日空飞舞
杨花终日空飞舞
东门之枌
定情诗
蝶恋花·伫倚危楼风细细
伫倚危楼风细细
南歌子·有感
鼓笛慢·乱花丛里曾携手
乱花丛里曾携手
两同心·楚乡春晚
楚乡春晚
浣溪沙·入夏偏宜澹薄妆
入夏偏宜澹薄妆
已凉
孔雀东南飞
少年游·离多最是
离多最是
如梦令·一饷凝情无语
一饷凝情无语
无题
牡丹亭记题词
大车
霓裳中序第一·亭皋正望极
亭皋正望极
钓鱼湾
红豆曲
念奴娇·书东流村壁
书东流村壁
清平乐·蕙心堪怨
蕙心堪怨
好时光·宝髻偏宜宫样
宝髻偏宜宫样
六州歌头·东风著意
东风著意
千秋岁·数声鶗鴂
数声鶗鴂
长亭送别
南歌子词二首 / 新添声杨柳枝词
绮怀十六首·其十五
华山畿·奈何许
奈何许
诉衷情·永夜抛人何处去
永夜抛人何处去
人南渡·兰芷满汀洲
兰芷满汀洲
念奴娇·凤凰山下
无题·八岁偷照镜
八岁偷照镜
和项王歌
牡丹
清平乐·春宵睡重
春宵睡重
无题二首
古怨别
拔蒲二首
江南曲四首
菩萨蛮·风帘燕舞莺啼柳
风帘燕舞莺啼柳
华山畿·君既为侬死
君既为侬死
南乡子·眼约也应虚
眼约也应虚
蒹葭
无题·飒飒东风细雨来
四愁诗
作蚕丝
黄金缕·家在钱塘江上住
惜秋华·七夕
踏歌词四首·其一
神女赋
万年欢·春思
锦瑟
蝶恋花·辛苦最怜天上月
七夕
衡门
阳春曲·题情
蝶恋花·几许伤春春复暮
鬲溪梅令·丙辰冬自无锡归作此寓意
江城子·初夜含娇入洞房
丘中有麻
后园凿井歌
女冠子·昨夜夜半
大堤曲
钗头凤·世情薄
君难托
望江南·春不见
登二妃庙
懊恼曲
浣溪沙·闺情
生查子·含羞整翠鬟
汉广
采桑子·土花曾染湘娥黛
琴台
赠妇诗三首
隰桑
荷叶杯·记得那年花下
出其东门
陌上赠美人
桂殿秋·思往事
江城子·帐里鸳鸯交颈情
塞鸿秋·爱他时似爱初生月
长恨歌
小长干曲
最高楼·旧时心事
代别情人
更漏子·金雀钗
荷叶杯·弱柳好花尽拆
菩萨蛮·蓬莱院闭天台女
无题·昨夜星辰昨夜风
蝴蝶儿·蝴蝶儿
题柳
寄人
黄葛篇
满江红·小院深深
薄幸·淡妆多态
春别诗四首·其三
应天长·平江波暖鸳鸯语
野有死麕
白头吟
子夜四时歌·绣带合欢结
定风波·感旧
应天长·别来半岁音书绝
子夜四时歌·自从别欢后
天仙子·草绿裙腰山染黛
祝英台近·惜多才
八六子·倚危亭
虞美人·春情只到梨花薄
钗头凤·红酥手
无题四首
南歌子·万万千千恨
寄欧阳詹
虞美人·彩云易向秋空散
西施·自从回步百花桥
如梦令·正是辘轳金井
洛神赋
江城子·竹里风生月上门
妾薄命行·其一
荷花
采桑子·谁翻乐府凄凉曲
少年游·重阳过后
解连环·酬任公用梦窗留别石帚韵
秦女卷衣
凤求凰
玉楼春·桃溪不作从容住
菩萨蛮·月华如水笼香砌
鬓云松令·枕函香
朝来曲
云鬟烟鬓与谁期
红绣鞋
春日行
女冠子·四月十七
落梅风·心间事
清平乐·风鬟雨鬓
杂曲歌辞·春江曲
菩萨蛮·铜簧韵脆锵寒竹
贺明朝·忆昔花间初识面
山有扶苏
瑞鹤仙·晴丝牵绪乱
浣溪沙·春情
摸鱼儿·雁丘词 / 迈陂塘·雁丘词
闻李端公垂钓回寄赠
鹊桥仙·云林瞩题闰七夕联吟图
小重山·花院深疑无路通
春晓
浣溪沙·谁念西风独自凉
玉楼春·春恨
野有蔓草
江城子·浣花溪上见卿卿
关雎
蟾宫曲·梦中作
系裙腰·般涉调
鹧鸪天·醉拍春衫惜旧香
一丛花令·伤高怀远几时穷
可叹
东门之墠
鹊桥仙·碧梧初出
柳毅传
诀别书
采莲子·船动湖光滟滟秋
忆江南·衔泥燕
省试湘灵鼓瑟
清平乐·红笺小字
潜别离
南歌子·玉漏迢迢尽
越人歌
江城子·迎得郎来入绣闱
采莲曲
长干行二首
菩萨蛮·牡丹含露真珠颗
江城子·斗转星移玉漏频
车遥遥篇
南乡子·相见处
八六子·如花貌
静女
雨中花慢·邃院重帘何处
如梦令·尘拂玉台鸾镜
赠人
昭君怨·暮雨丝丝吹湿
画堂春·一生一代一双人
马嵬·其二
九歌·山鬼
生查子·元夕
菩萨蛮·青岩碧洞经朝雨
七日夜女歌·其二
南歌子·倭堕低梳髻
小桃红·晓妆
终身误
竹枝词九首
江城子·西城杨柳弄春柔
小桃红·满城烟水月微茫
木兰花·燕鸿过后莺归去
浪淘沙·海底飞尘终有日
虞美人·银床淅沥青梧老
蝶恋花·记得画屏初会遇
迎春乐·菖蒲叶叶知多少
上邪
本事诗十首·选二
南歌子·懒拂鸳鸯枕
诉衷情·花前月下暂相逢
鹊桥仙·纤云弄巧
浣溪沙·红藕花香到槛频
愁倚阑令·花阴月
浪淘沙·目送楚云空
浣溪沙·辛亥正月二十四日发合肥
隔汉江寄子安
写情
迷仙引·才过笄年
鹊踏枝·萧索清秋珠泪坠
碧城三首
咏同心芙蓉
卷珠帘·记得来时春未暮
西江月·携手看花深径
子夜四时歌·春风动春心
鹊桥仙·说盟说誓
眉妩·戏张仲远
赠夫二首 / 题云泉台客韦璜
赠邻女 / 寄李亿员外
浪淘沙·借问江潮与海水
虞美人·玉楼缥缈孤烟际
暮秋独游曲江
匏有苦叶
雉朝飞
月夜重寄宋华阳姊妹
菁菁者莪
集贤宾·小楼深巷狂游遍
赠去婢
渔家傲·灰暖香融销永昼
风入松·为友人放琴客赋
采桑子·而今才道当时错
生查子·新月曲如眉
浣溪沙·半踏长裾宛约行
二郎神·炎光谢
卜算子·赠乐婉杭妓
卜算子·我住长江头
落花
高唐赋
春雨
沁园春·情若连环
古离别
蝶恋花·十二楼前生碧草
绿水词
谢池春慢·玉仙观道中逢谢媚卿
醉高歌过红绣鞋·乐心儿比目连枝
湘妃
江城子·乙卯正月二十日夜记梦
夜雨
清平乐·夏日游湖
浪淘沙·其二
银河吹笙
九歌·湘夫人
离思五首
菩萨蛮·花明月暗笼轻雾
清江引·相思
木兰花·清琴再鼓求凰弄
青玉案·新腔一唱双金斗
子夜四时歌·渊冰厚三尺
西施 / 咏苎萝山
无题·重帏深下莫愁堂
七日夜女歌·其一
溱洧
石榴
桑中
虞美人·春山拂拂横秋水
卜算子·答施
韩庄闸舟中七夕
青玉案·凌波不过横塘路
落花时·夕阳谁唤下楼梯
秋夜月·当初聚散
有所思
古相思曲·其一
采桑子·金风玉露初凉夜
穆穆清风至
金明池·咏寒柳
寄生草·间别
落梅风·因他害
阮郎归·宫腰袅袅翠鬟松
竹枝词二首·其一
鹧鸪天·彩袖殷勤捧玉钟
折桂令·春情
东门之杨
饮马长城窟行
薄幸·青楼春晚
莺啼序·荷和赵修全韵
七夕歌
寓意 / 无题·油壁香车不再逢
探芳信·为春瘦
转调二郎神·闷来弹鹊
解连环·秋情
采莲子二首
满江红·代北燕南
韩偓
鱼玄机
钱起
杜公瞻
司马相如
贯云石
顾敻
柳永
贾固
姚宽
郑光祖
韦庄
陈琳
周邦彦
曹雪芹
王之道
程垓
秦观
李隆基
欧阳修
贯休
牛希济
李贺
和凝
张耒
崔郊
萧纲
李清照
王实甫
纳兰性德
姜夔
曹植
卓文君
孙光宪
姚燮
岳珂
文廷式
黄景仁
孟郊
苏曼殊
张先
晏殊
幼卿
皇甫松
元好问
吴文英
马致远
秦嘉
储光羲
贺铸
唐婉
萧子显
鲍照
杜甫
牛峤
毛文锡
杨果
韦璜
张衡
郭元振
汤显祖
柳如是
贺双卿
郑文妻
萧衍
李群玉
项鸿祚
虞姬
乐婉
麦孟华
史达祖
卢仝
李之仪
苏轼
冯延巳
韩元吉
白朴
宋玉
李商隐
崔国辅
李白
欧阳炯
张红桥
邵瑞彭
傅玄
太原妓
朱淑真
查德卿
徐再思
晏几道
佚名
施酒监
吴均
李朝威
辛弃疾
朱彝尊
温庭筠
欧阳澈
严蕊
繁钦
司马槱
刘禹锡
屈原
元稹
白居易
蜀妓
李珣
李益
徐伸
顾太清
陆游
李煜
魏夫人
于鹄
张泌
王安石
顾夐
乔吉
吕渭老
王昌龄
近现代
明代
元代
五代
金朝
未知
先秦
魏晋
隋代
唐代
清代
南北朝
宋代
两汉
谁写的
什么内容
哪个朝代
作者是谁
写了什么诗
有哪些作品
哪些诗
描写什么
有哪些诗
